/*function some(str) {
    console.log(str.match(/love/gmi)),
    console.log(str.match(/like/gmi))
    console.log(str.replace(/like/gmi, 'milk'))
}

some('i like love you 123')*/

// function str(str) {
//     return /like/.test(str)
// }

// console.log(str('21 3, i love LOVE cats'))

/* Буквенные классы:
\d - любая цифра
\w - латинская буква или цифра или нижнее подчерскивание _
\s - пробел
\D- - любой символ кроме \d
\W- - любой символ кроме \w
\S- - любой символ кроме \s
*/
//
// console.log(
//     /\s/.match('22 January')
// )
//////////////////////////////////////////////////////////////////////////////////////
/*
Якоря:
^ - начало строоки
$ - конец строки
\b - граница строки
*/

// console.log(
//     /\w$/.test('22 january'),
//     /^\d/.test('22 january'),
//     /\bOF\b/i.test('22 of january')
// )
////////////////////////////////////////////////////////////////////////////////////////////////////

// Наборы и дапазоны
//
// [sdr] - любой символ из скобок
// [A-Z] - большие буквы
// [a-z] - маленькие
// [0-9] - цифры

/*
[^0-9] - все что угодно но не цифра от 0-9
[^a-z] - все что угодно кроме букв с a до z

console.log(
    /[sdf]/.test('gggggs'),
    /[0-9]/.test('12')
)
*/

///////////////////////////////////////////////////////////////////////////////////////////////////

// Квандификаторы


/*
 {n} - точное количество
 {n1, n2} - количество от n1 до n2
 {n1, } - минимальное количество от n1, типо пароль минимум 6 цифр
*/

// console.log(
//     /\d{7,}/.test('1234567') // пароль от 7 цифр и в консоле тру будет
// )
//
// console.log(
//     /\d{3}/.test('123') // любые цифры три подряд и выведется тру
// )

///////////////////////////////////////////////////////////////////////////////////////////////////

// Сокращения квандетификаторов

/*

+ {1,} - от одного до бесконечности
? {0,1} - от нуля до одного
* {0,} - от нуля и выше

*/

// console.log(
//     /\d+/.test('asdsd 12')
// )

///////////////////////////////////////////////////////////////////////////////////////////////////

// оператор ИЛИ |

// console.log(
//     /html|js/.test('i love js')
// )


